app/views/viewers/_recipes.html.erb

      <td width ="40" align ="center">:)</td>
      <td width ="40" align ="center">:(</td>
      <td width ="40" align ="center">[][]</td>
    </tr>

   <%@recipes.each do |recipe| %>
    <tr>
      <td><div id="title6_black">
          <%= link_to recipe.title_concat, :action => 'show', :controller => 'recipes', :id => recipe.id, :query => @query %></div> <!--{:style=>'color:black; hover'} -->
          <div id="title10_gray">by
          <%= recipe.user.name[0...30] %> on
          <%= recipe.created_at.strftime("%B %d, %Y") %>
          </div>
      </td>
     <td><div id="title10_gray" align ="center">
          <%= recipe.num_of_likes %></div></td>
     <td><div id="title10_gray" align ="center">
          <%= recipe.num_of_hates %></div></td>
     <td><div id="title10_gray" align ="center">
         <%= recipe.stories.count %></div></td>
   </tr>
   <% end %>
---
SELECT COUNT(*) FROM `stories` WHERE (`stories`.recipe_id = 33) AND (private = 0)
SELECT `stories`.* FROM `stories` WHERE (`stories`.recipe_id = 33) LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 13 LIMIT 1