app/views/users/_paginate.html.erb

    <% @query[:page] += 1 %>
      <% if ((@action == 'index' && @recipes != nil  && @recipes.count != 0) || (@action == 'indexstories' && @stories != nil  && @stories.count != 0)) %>
---
SELECT COUNT(*) FROM `stories` WHERE (`stories`.recipe_id = 25) AND (user_id <> 13 AND private = 0)