app/controllers/recipes_controller.rb

SELECT COUNT(*) FROM `recipes` WHERE `recipes`.`id` = 333
SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 25 LIMIT 1
---
  def shortcut
    if params[:id].empty?
      redirect_to root_path(:errormsg => "enter a recipe number")
    elsif Recipe.where(:id => params[:id]).empty?

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 25 LIMIT 1
SELECT COUNT(*) FROM `stories` WHERE (`stories`.recipe_id = 25) AND (user_id <> 13 AND private = 0)
---
  def show

    @recipe = Recipe.find(params[:id]) #grab the recipe...easy enough
    if @recipe.private == true #should you be viewing this recipe?
      if current_user.nil?
        redirect back_path(:errormsg => "could not find")
      elsif @recipe.user_id != current_user.id
        redirect back_path(:errormsg => "could not find")
      end
    end
    @author_recipe = @recipe.user # now grab author of said recipe
    @story_count = @recipe.stories.where("user_id <> ? AND private = ?", current_user.id, 0).count # alright, how many stories does this recipe have?

SELECT `stories`.* FROM `stories` WHERE (id < 1 AND recipe_id = 33 AND user_id = 13) ORDER BY id desc LIMIT 1
---
    end

    # Alright, now which set of stories should I get first???
    if (@my_story_count > 0 && @show_my_stories == 'yes') #if I have stories then...
        @story = @recipe.stories.where(:user_id => current_user.id).first # Grab my first story

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 33 LIMIT 1
---
  def edit
    @recipe = Recipe.find(params[:id])

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 33 LIMIT 1
---
  def update
    @recipe = Recipe.find(params[:id])