app/controllers/recipefavourites_controller.rb

SELECT `recipefavourites`.`id` FROM `recipefavourites` WHERE `recipefavourites`.`recipe_id` = 21 AND (`recipefavourites`.`user_id` = 13) AND (`recipefavourites`.id <> 56) LIMIT 1
UPDATE `recipefavourites` SET `rating` = 'maybe', `updated_at` = '2011-07-30 20:53:21' WHERE `recipefavourites`.`id` = 56
---
  def update
    # We've just been told that we need to change a rating on a recipe.  Alright!  Let's do it!
    fav = Recipefavourite.where(:user_id => params[:user_id], :recipe_id => params[:recipe_id]).first
    fav.rating = params[:rating]
    fav.save