app/controllers/recipes_controller.rb

  def show

    @recipe = Recipe.find(params[:id]) #grab the recipe...easy enough
    @author_recipe = @recipe.user # now grab author of said recipe
    @story_count = @recipe.stories.count # alright, how many stories does this recipe have?

    @favourite_recipe = nil # default for now
    @show_my_stories = "no" # default for now
    @my_story_count = 0 # default for now
    @query = params[:query]

    if signed_in?
      fav = current_user.has_favourite_get_rating(@recipe)
      if fav != nil # If this recipe is one of my favourites then...
        @favourite_recipe = fav # Tells the view that this recipe is one of my favourite
        @my_story_count = @recipe.stories.where(:user_id => current_user.id).count
        @show_my_stories = case params[:show_my_stories] # are we scrolling through my stories, or all stories?
          when nil then "yes" # if not instructed, then scroll through my stories first
          else params[:show_my_stories]
          end
      else # This is just some recipe I've come across
        @favourite_recipe = "no" # since this is not in my scrapbook, give me option to add it
      end
    end

    # Alright, now which set of stories should I get first???
    if @my_story_count > 0 #if I have stories then...
        @story = @recipe.stories.where(:user_id => current_user.id).first # Grab my first story
        @author_story = current_user # I'm obviously the author of this story!
    elsif @story_count > 0 #if this recipe has any stories then...
        @story = @recipe.stories.first # Grab the first story
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1