app/controllers/stories_controller.rb

SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 1 LIMIT 1
---
  def edit
    @story = Story.find(params[:id])

SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 4 LIMIT 1
DELETE FROM `stories` WHERE `stories`.`id` = 4
---
  def destroy
    @story = Story.find(params[:id])
    @recipe = @story.recipe

    if (@story.user != current_user || @story == nil)
      render 'show'
    else
      if @story.photo_file_size != nil
        @story.photo.destroy