app/controllers/stories_controller.rb

  def show

    @story = Story.find(params[:id])
    @recipe = @story.recipe
    @author_recipe = User.find(@recipe.user_id)
    @author_story = User.find(@story.user_id)
    @story_count = @recipe.stories.count # alright, how many stories does this recipe have?
---
SELECT `stories`.* FROM `stories` WHERE (id < 1 AND recipe_id = 33 AND user_id = 13) ORDER BY id desc LIMIT 1
SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 33 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 13 LIMIT 1
SELECT COUNT(*) FROM `stories` WHERE (`stories`.recipe_id = 33) AND (user_id <> 13 AND private = 0)

  def new
    @recipe = Recipe.find(params[:recipe_id])
    @story = Story.new
    @author_recipe = User.find(@recipe.user_id)
---
SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 33 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 13 LIMIT 1

   def create
    @story = Story.new(params[:story])

    respond_to do |format|
      if @story.save
---
INSERT INTO `stories` (`recipe_id`, `user_id`, `private`, `title`, `thestory`, `category`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `created_at`, `updated_at`) VALUES (33, 13, 0, 'Story With No Image', 'This is a story with no image. Just want to test this out.', 'bite me', NULL, NULL, NULL, '2011-07-30 20:11:08', '2011-07-30 20:11:08')