app/controllers/users_controller.rb

SELECT COUNT(*) FROM `recipefavourites` WHERE `recipefavourites`.`rating` = 'keeper' AND (`recipefavourites`.recipe_id = 28)
SELECT COUNT(*) FROM `recipes` INNER JOIN `recipefavourites` ON `recipes`.id = `recipefavourites`.recipe_id WHERE ((`recipefavourites`.user_id = 13)) AND (recipefavourites.rating = 'keeper')
SELECT COUNT(*) FROM `stories` WHERE (`stories`.recipe_id = 28) AND (user_id <> 13 AND private = 0)
SELECT `recipes`.* FROM `recipes` INNER JOIN `recipefavourites` ON `recipes`.id = `recipefavourites`.recipe_id WHERE ((`recipefavourites`.user_id = 13)) AND (recipefavourites.rating = 'keeper') AND (recipes.course = 'sweet') ORDER BY created_at DESC
---
  def index #this shows the users recipe book

    if signed_in?

      items_per_page = 23

      @user = current_user

      # default query setting if it can't find the :query hash
      if params[:query] == nil
        params[:query] = {:sort => "new", :course => "all", :pile => "keeper", :page => 0}
      end

        page = get_page_info(params[:query][:page])
        start_record = page * items_per_page
        end_record = (page+1) * items_per_page

        pile = get_pile_info(params[:query][:pile])

        course = get_course_info(params[:query][:course])

        sort = get_sort_info(params[:query][:sort])

        @query = {:sort => sort, :course => course, :pile => pile, :page => page}

        @title_left = pile.capitalize + "'s: "
        @title_right = course.capitalize
        @keeper_count = @user.recipes.where("recipefavourites.rating = 'keeper'").count
        @maybe_count = @user.recipes.where("recipefavourites.rating = 'maybe'").count
        @stories_count = @user.stories.count
        @action = "index"

      @recipe = @user.recipes.where("recipefavourites.rating = ?", pile.to_s)

SELECT COUNT(*) FROM `recipes` INNER JOIN `recipefavourites` ON `recipes`.id = `recipefavourites`.recipe_id WHERE ((`recipefavourites`.user_id = 13)) AND (recipefavourites.rating = 'keeper')
SELECT COUNT(*) FROM `stories` WHERE (`stories`.user_id = 13)
SELECT `stories`.* FROM `stories` WHERE (`stories`.user_id = 13) ORDER BY created_at DESC
---
  def indexstories #this shows the users recipe book

      items_per_page = 15

      @user = current_user

      # default query setting if it can't find the :query hash
      if params[:query] == nil
        params[:query] = {:sort => "new", :course => "all", :pile => "keeper", :page => 0}
      end

      page = get_page_info(params[:query][:page])
      start_record = page * items_per_page
      end_record = (page+1) * items_per_page

      pile = get_pile_info(params[:query][:pile])

      course = get_course_info(params[:query][:course])

      sort = get_sort_info(params[:query][:sort])

      @query = {:sort => sort, :course => course, :pile => pile, :page => page}

      @title_left = "My Stories"
      @title_right = ""
      @keeper_count = @user.recipes.where("recipefavourites.rating = 'keeper'").count
      @maybe_count = @user.recipes.where("recipefavourites.rating = 'maybe'").count
      @stories_count = @user.stories.count
      @action = "indexstories"

      @stories = @user.stories.order(sort)[start_record...end_record]

INSERT INTO `users` (`name`, `bookname`, `email`, `encrypted_password`, `salt`, `created_at`, `updated_at`) VALUES ('Heather Chase', 'Kick Your Big Fat Butt', 'heather.chase@gmail.com', 'ff7a406c4989d922a070d2b3143d4c965fdd7c2ad09e41f8d70521bb98d8e440', '8d80a74ec0fabdecb4bc1eaddc693dc420bd8911a1d56c02863f312cc289abda', '2011-08-05 23:22:52', '2011-08-05 23:22:52')
---
  def create
    @user = User.new(params[:user])

    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 13 LIMIT 1
UPDATE `users` SET `name` = 'Maretta and Lee', `encrypted_password` = 'db74c4f5038196aaf5f075062ede2ae2cbe9be24dc797abb94a0c0aa79a5dabb', `updated_at` = '2011-08-02 01:41:44' WHERE `users`.`id` = 13
---
  def update
    @user = User.find(params[:id])
    if params[:user][:password].empty?
      params[:user][:password] = @user.password
      params[:user][:password_confirmation] = @user.encrypted_password
    end
      if @user.update_attributes(params[:user])