app/controllers/viewers_controller.rb

      if sort == "rate"
        @recipes = @recipe.all.sort_by{|recipe| -recipe.rating_equation.to_i}[start_record...end_record]
      elsif sort == "story"
        @recipes = @recipe.all.sort_by{|recipe| -recipe.all_story_count.to_i}[start_record...end_record]
---
SELECT COUNT(*) FROM `stories` WHERE (`stories`.recipe_id = 32) AND (private = 0)
SELECT `stories`.* FROM `stories` WHERE (`stories`.recipe_id = 33) ORDER BY stories.id DESC LIMIT 1

        @title_more_right = "  ( filtered by '" + storytag.downcase + "' )"
      end
      @stories = @stories.where("private = ?", 0)
      @stories = @stories.where("stories.category = ?", emo).order(sort)[start_record...end_record]
---
SELECT `stories`.* FROM `stories` WHERE (private = 0) AND (stories.category = 'bite me') ORDER BY created_at DESC